{"timestamp":"1970-01-05 04:27:12",
 "type":"story",
 "title":"About me",
 "image":"",
 "slug":"about-me",
 "text":"<p>Ik ben een allround softwareontwikkelaar en -ontwerper met een goed abstract denkvermogen en een projectmatige instelling. Projecten worden opgeleverd in hoge kwaliteit door een (zelf-)kritische instelling en goed debugging inzicht. Realistische deadlines geven mij extra focus; onder druk werken is geen probleem. \n</p>\n<p>Ik kan goed samenwerken en meedenken met klanten en designers om de applicatie qua front- en back-end te optimaliseren en uit te werken. Een overtuigend, werkend prototype is snel in elkaar gezet. Met nieuwe technieken en in nieuwe gebieden ben ik snel productief. \nDaarnaast kan ik prima zelfstandig werken zonder de samenwerking met collega's uit het oog te verliezen.\n</p>\n<p>Deze eigenschappen maken mij bij uitstek geschikt voor project-gerichte organisaties die vernieuwende toepassingen bedenken en implementeren, en daar ligt ook precies mijn interesse.\n</p>\n\n</div>\n<div class=\"block\">\n\n<h2>Werkervaring</h2>\n\n<dl>\n<dt>1999-heden: Senior Software Engineer bij Guidance BV te Capelle a/d IJssel</dt>\n<dd>\n<p>Verantwoordelijk voor de complete opzet, uitwerking en ontwikkeling van de standaardsoftware Stentor op basis waarvan internet- en cd-rom e-commerce projecten gestalte gegeven worden. Dit omhelst zowel een framework als een cms-applicatie. Invulling geven aan de technische analyse, het ontwerp (GUI en structuur) en de opzet van de ontwikkeling van klant-projecten, waarna deze zelf of door junior medewerkers afgerond worden. Technisch aanspreekpunt voor zowel klanten als collega's. Ontwikkeling van alle niet-standaard componenten die nodig zijn om het project compleet op te leveren naar de wensen van de klant, zoals koppelingen met ERP systemen via XML, OCI, Java of andere technieken, online betalingen (via Ogone en iDEAL), klantspecifieke functionaliteit en aansluiting op andere systemen.\n</p>\n<p>De standaardsoftware is opgezet aan de hand van relationele databases (PostgreSQL, MySQL, Oracle en andere), het Zend Framework, PHP scripts en custom extensies (geschreven in C en C++) voor PHP. De nadruk van deze software ligt op business-to-business functionaliteit en cross-platform toepasbaarheid. Clientside worden de applicaties opgezet in HTML, CSS en Javascript, waarbij voor Ajax-toepassingen jQuery ingezet wordt. Andere tools zoals data-conversies of thumbnail-makers worden vaak in Python geschreven.\n</p>\n<p>Ontwerp en ontwikkeling van het web-frontend voor het Catalogger CMS, waarbij extra functionaliteit als versiebeheer en workflow toegevoegd is.\n</p>\n<p>Overige verantwoordelijkheden omvatten uitwerking van nieuwe ideeën en inschatting van de technische en commerciële haalbaarheid hiervan (onder andere beeldbank applicatie, InDesign vertaal applicatie, iPhone applicatie), het ontwikkelen van ondersteunende tools waar nodig, ook voor de andere discipline binnen het bedrijf (database publishing naar papier, via Catalogger). Hiervoor wordt gebruik gemaakt van de SDK's voor Adobe FrameMaker, Quark XPress en Adobe InDesign, waarvoor vele plugins zijn geschreven (C/C++). Ook ondersteuning bij het opzetten van de hard- en software voor de internet-projecten hoort erbij.\n</p>\n<ul>\n<li><a href=\"http://www.guidance.nl\">www.guidance.nl</a></li>\n<li><a href=\"http://demo.guidance.nl\">demo.guidance.nl</a></li>\n</ul>\n</dd>\n\n<dt>1995-1999: Senior Software Engineer bij Info'aktief BV te Rotterdam</dt>\n<dd>\n<p>Analyse, ontwerp (GUI en structuur) en ontwikkeling van marketing communicatie software, zoals onder andere catalogi, selectie-applicaties op basis van fysische berekeningen, bedrijfspresentaties en internet-sites. Hiertoe hoort ook het ontwerp van databases en de bijbehorende onderhoudsapplicaties. Zowel applicatie als database zijn op maat gesneden voor de klant. Ontwikkeling in C/C++ onder DOS en Windows.\n</p>\n<p>Overige werkzaamheden bestaan uit het onderhoud van de hard- en software, het grafisch ontwerp van verpakkingen voor de applicaties en het ondersteunen van collega's op elk gebied.\n</p>\n</dd>\n</dl>\n\n</div>\n<div class=\"block\">\n\n<h2>Overige projecten</h2>\n\n<p>Naast een vaste baan heb ik een aantal applicaties en websites ontworpen en gebouwd, zowel via m'n eigen bedrijf als uit hobby. Hieronder volgen een aantal voorbeelden.</p>\n\n<dl>\n\n<dt>2009: Bokslag Test Centrum</dt>\n<dd>\n<p>De website waarmee psychologisch adviesbureau Bokslag kandidaten via internet vragenlijsten kan laten invullen. Deze vragenlijsten testen bijvoorbeeld taalkennis, logisch redeneren of ruimtelijk inzicht, al dan niet gekoppeld aan een tijdslimiet. Bokslag kan zelf vragen en vragenlijsten aanmaken en koppelen aan kandidaten. Het Bokslag Test Centrum is ontwikkeld in Python mbv het Django framework. De Django beheers-interface is uitgebreid met Excel-export van geselecteerde vragen, vragenlijsten en testrapporten van kandidaten, zodat Bokslag zelf statistieken kan bijhouden.\n</p>\n<ul>\n<li><a href=\"http://testen.bokslag.nl/\">testen.bokslag.nl</a>\n    <p>Zonder login is hier niet veel te zien, maar je kunt mij mailen om een test-account aan te vragen voor de versie die lokaal op mijn server draait.</p></li>\n</ul>\n</dd>\n\n<dt>2007: Martine Peters</dt>\n<dd>\n<p>De website van Martine Peters, een portfolio voor haar fotografie-activiteiten. Ontwikkeld in Python mbv het Django framework. De foto's en omschrijvingen voert ze zelf in via de admin interface.\n</p>\n<ul>\n<li>www.martinepeters.nl</li>\n</ul>\n</dd>\n\n<dt>2007: Hélène van der Kraats</dt>\n<dd>\n<p>De website van mijn zus, voornamelijk voor de presentatie van haar tekeningen en schilderijen. Ontwikkeld in Python mbv het Django framework. De administrator interface geeft haar de mogelijkheid al het onderhoud van de pagina's zelf te verzorgen.\n</p>\n<ul>\n<li><a href=\"http://www.helenevanderkraats.nl\">www.helenevanderkraats.nl</a></li>\n</ul>\n</dd>\n\n<dt>2004: Laolaz sjaals en sieraden</dt>\n<dd>\n<p>De Laolaz website, een eenvoudig opgezette tweetalige webwinkel, gebouwd in PHP. Er is geen gebruik gemaakt van een SQL database, maar van PHP-gebaseerde data-bestanden en een sessie-gebaseerde bestelmand.\n</p>\n<ul>\n<li><a href=\"http://laolaz.million.nl\">laolaz.million.nl</a></li>\n</ul>\n</dd>\n\n<dt>2003-heden: ThudBoard applicatie website</dt>\n<dd>\n<p>ThudBoard is een desktop applicatie die het online spelen van het bordspel Thud eenvoudiger maakt door het speelbord te visualiseren en alle zetten bij te houden. Deze applicatie is gebouwd in Python met Tkinter voor de GUI, en werkt onder Windows, Linux, FreeBSD, OpenBSD en Mac OS X. De applicatie is in het Engels, Tsjechisch en Nederlands beschikbaar. Nieuwe skins zijn gemaakt door gebruikers en extern downloadbaar. \n</p>\n<ul>\n<li><a href=\"http://www.million.nl/thudboard\">www.million.nl/thudboard</a></li>\n<li><a href=\"http://www.million.nl/thudboard-nl\">www.million.nl/thudboard-nl</a></li>\n<li><a href=\"http://www.million.nl/thudboard-cz\">www.million.nl/thudboard-cz</a></li>\n</ul>\n</dd>\n\n<dt>2001-heden: PHP DBX module</dt>\n<dd>\n<p>De DBX module van PHP is ontwikkeld zowel binnen de werkzaamheden bij Guidance BV als in eigen tijd. De DBX module is een database abstractie API, waardoor de database-backend voor applicaties vervangbaar wordt. Deze module is gebouwd in C/C++ en de bijbehorende unittests in PHP. Database ondersteuning voor ODBC, Oracle, MS SQL Server, MySQL, PostgreSQL, SQLite, Sybase CT en Frontbase, waarvan alle wrappers behalve PostgreSQL en Frontbase zelf zijn ontwikkeld. Onderdeel van de standaard PHP distributie tot 5.1.0, sinds die versie is DBX te vinden in PECL.\n</p>\n<ul>\n<li><a href=\"http://www.php.net/dbx\">www.php.net/dbx</a></li>\n</ul>\n</dd>\n\n<dt>2000: Focus</dt>\n<dd>\n<p>Een concentratie-test programma voor Bokslag BV, een psychologisch adviesbureau. Dit is een Windowsapplicatie ontwikkeld in C++ mbv MFC.\n</p>\n</dd>\n\n<dt>1999-heden: Snookercompetitie website</dt>\n<dd>\n<p>De website waar de snookercompetitie voor www.snoekoii.net (ons snookerteam) wordt bijgehouden. Iedere dag wordt automatisch de stand bij de KNBB opgehaald, iedere week worden emails naar de teamleden gestuurd met de komende wedstrijdgegevens, en het wedstrijdschema is ook beschikbaar in iCal formaat. De site is ontwikkeld in PHP met een MySQL database. Van 2003 tot 2008 is deze applicatie ook toegepast voor de squashcompetitie.\n</p>\n<ul>\n<li>www.snoekoii.net</li>\n<li>heren16.million.nl</li>\n</ul>\n</dd>\n\n<dt>1998-heden: million.nl website</dt>\n<dd>\n<p>Mijn eigen domein, een combinatie van korte artikelen en foto-galleries. Oorspronkelijk gebouwd in PHP en MySQL, in 2006 redesigned en herschreven in Python mbv het Django framework. Opnieuw herschreven in 2013 als single-page webapp met json backend, geschreven in javascript mbv jQuery.\n</p>\n<ul>\n<li><a href=\"http://www.million.nl\">www.million.nl</a></li>\n</ul>\n</dd>\n\n<dt>1998: TimeTable</dt>\n<dd>\n<p>Een tekstgebaseerde applicatie die de speelduur en tarieven voor de tafels in de lokale snookerclub bijhoudt. Dit programma wordt tot op heden nog steeds gebruikt. Ontwikkeling in C/C++ voor DOS.\n</p>\n</dd>\n\n<dt>1994: opdracht naast studie voor Kipp &amp; Zonen Delft bv</dt>\n<dd>\n<p>Een interactieve grafische presentatie van het bedrijf en de producten van de solar-afdeling, later uitgebreid met een tijdsgestuurde navigatie (slideshow) voor gebruik op beurzen. Ontwikkeling in Pascal mbv een grafische library, voor werking onder DOS. Via deze applicatie ben ik in contact gekomen met Info'aktief, waar ik na mijn studie ben gaan werken.\n</p>\n</dd>\n</dl>\n\n</div>\n<div class=\"block\">\n\n<h2>Stages voor studie</h2>\n\n<dl>\n<dt>1992: afstudeerstage van 4 maanden bij Kipp &amp; Zonen Delft bv</dt>\n<dd>\n<p>Ontwikkeling van calibratie-methoden voor de pyrgeometer (infrarood- stralingsmeter).\n</p>\n</dd>\n\n<dt>1990-1991: 3 stages van elk 3 maanden voor de TH Rijswijk</dt>\n<dd>\n<p>Kipp &amp; Zonen Delft bv, Philips Eindhoven en TU Delft elektrotechniek.\n</p>\n</dd>\n</dl>\n\n</div>\n<div class=\"block\">\n\n<h2>Opleidingen</h2>\n\n<dl>\n<dt>1992-1995:</dt><dd><p>TU Delft technische natuurkunde - patroonherkenning</p></dd>\n<dt>1988-1992:</dt><dd><p>TH Rijswijk technische natuurkunde - fotonica</p></dd>\n<dt>1982-1988:</dt><dd><p>VWO wis- en natuurkunde</p></dd>\n</dl>\n\n</div>\n<div class=\"block\">\n\n<h2>Overige informatie</h2>\n\n<p>\nGeboren 5 januari 1970<br/>\nNederlandse nationaliteit<br/>\nRijbewijs B<br/>\nGehuwd<br/>\n"
}
